package AirLineProgram.Run;

import java.text.SimpleDateFormat;
import java.util.Date;

public class DataDummy implements Runnable {

	public static String[] flight_Code, airLine, s_airport, a_airport, s_gate, a_gate, s_time, a_time, checkin, baggage,
			state, a_terminal, s_terminal, s_airportCode, a_airportCode, airport_category;
	public static int airlength;

	public DataDummy() {
		airport_category = new String[] { "ICN", "JFK", "ADD", "CDG", "DXB", "SYD" };
		flight_Code = new String[] { "DL9015", "AR7861", "OZ222", "UA7293", "CM8004", "TG6745", "SQ5722", "OZ221",
				"AR7860", "SQ5720", "ET672", "FZ648", "ET600", "ET612", "EK724", "ET602", "ET601", "EK206", "EK201",
				"EK203", "EK205", "QF012", "DY7022", "AY5808", "AF007", "KE952", "EK322", "EK3482", "EK414", "EK412",
				"EK416", "AF655", "EK73", "EK75", "ET350", "OZ501", "AF0267", "KE0901", "OZ0601", "KE121", "KE5951",
				"KE951", "ET705", "OZ504", "DY7021", "AY5809", "AF22", "AF8", "EK76", "QF0011", "DZ602", "KE122",
				"EK417", "EK415", "EK413", "KE086", "OZ229", "EK202", "EK204", "AY5810", "AF023", "AF09", "AF13",
				"AF11", "AF3577", "DL6798", "QF12", "QF16", "QF521", "DL6799", "DL1268", "DL2164", "ET704", "KE902",
				"AF264", "OZ502", "EK72", "EK74", "EK78", "TEST" };

		airLine = new String[] { "델타항공", "아르헨티나 항공", "아시아나 항공", "유나이티드 항공", "코파항공", "아시아나 항공", "싱가포르 항공", "아시아나 항공",
				"아르헨티나 항공", "싱가포르 항공", "에티오피아 항공", "플라이두바이 항공", "에티오피아 항공", "에티오피아 항공", "에미레이트 항공", "에티오피아 항공",
				"에티오피아 항공", "에미레이트 항공", "에미레이트 항공", "에미레이트 항공", "에미레이트 항공", "콴타스 항공", "노르웨이 항공", "핀에어 항공", "에어프랑스 항공",
				"대한항공", "에미레이트 항공", "에미레이트 항공", "에미레이트 항공", "에미레이트 항공", "에미레이트 항공", "에어프랑스 항공", "에미레이트 항공", "에미레이트 항공",
				"에티오피아 항공", "아시아나 항공", "에어프랑스 항공", "대한항공", "아시아나 항공", "대한항공", "대한항공", "대한항공", "에티오피아 항공", "아시아나 항공",
				"노르웨이 항공", "핀에어 항공", "에어프랑스 항공", "에어프랑스 항공", "에미레이트 항공", "콴타스 항공", "아시아나 항공", "대한항공", "에미레이트 항공",
				"에미레이트 항공", "에미레이트 항공", "대한항공", "아시아나 항공", "에미레이트 항공", "에미레이트 항공", "핀에어 항공", "에어프랑스 항공", "에어프랑스 항공",
				"에어프랑스 항공", "에어프랑스 항공", "에어프랑스 항공", "델타항공", "콴타스 항공", "콴타스 항공", "콴타스 항공", "델타항공", "델타항공", "델타항공",
				"에티오피아 항공", "대한항공", "에어프랑스 항공", "아시아나 항공", "에미레이트 항공", "에미레이트 항공", "에미레이트 항공", "TEST 항공" };

		s_airportCode = new String[] { "ICN", "ICN", "ICN", "ICN", "ICN", "ICN", "ICN", "JFK", "JFK", "JFK", "ADD",
				"ADD", "ADD", "ADD", "ADD", "ADD", "DXB", "JFK", "DXB", "DXB", "DXB", "JFK", "JFK", "JFK", "JFK", "DXB",
				"DXB", "DXB", "DXB", "DXB", "DXB", "DXB", "DXB", "DXB", "ADD", "ICN", "ICN", "ICN", "ICN", "ICN", "ICN",
				"ICN", "CDG", "CDG", "CDG", "CDG", "CDG", "CDG", "CDG", "SYD", "SYD", "SYD", "SYD", "SYD", "SYD", "JFK",
				"JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "SYD", "SYD",
				"SYD", "ADD", "CDG", "CDG", "CDG", "CDG", "CDG", "CDG", "ADD" };

		a_airportCode = new String[] { "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "JFK", "ICN", "ICN", "ICN", "ICN",
				"DXB", "DXB", "DXB", "DXB", "DXB", "ADD", "DXB", "JFK", "JFK", "JFK", "SYD", "CDG", "CDG", "CDG", "ICN",
				"ICN", "ICN", "SYD", "SYD", "SYD", "CDG", "CDG", "CDG", "CDG", "CDG", "CDG", "CDG", "SYD", "SYD", "DXB",
				"DXB", "ADD", "ICN", "JFK", "JFK", "JFK", "JFK", "DXB", "JFK", "ICN", "ICN", "DXB", "DXB", "DXB", "ICN",
				"ICN", "DXB", "DXB", "CDG", "CDG", "CDG", "CDG", "CDG", "CDG", "SYD", "SYD", "SYD", "SYD", "JFK", "JFK",
				"JFK", "CDG", "ICN", "ICN", "ICN", "DXB", "DXB", "DXB", "ICN" };

		s_airport = new String[] { "인천", "인천", "인천", "인천", "인천", "인천", "인천", "뉴욕", "뉴욕", "뉴욕", "볼레", "볼레", "볼레", "볼레",
				"볼레", "볼레", "두바이", "뉴욕", "두바이", "두바이", "두바이", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "두바이", "두바이", "두바이", "두바이", "두바이",
				"두바이", "두바이", "두바이", "두바이", "볼레", "인천", "인천", "인천", "인천", "인천", "인천", "인천", "파리", "파리", "파리", "파리",
				"파리", "파리", "파리", "시드니", "시드니", "시드니", "시드니", "시드니", "시드니", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕",
				"뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "시드니", "시드니", "시드니", "볼레", "파리", "파리", "파리", "파리", "파리",
				"파리", "인천" };

		a_airport = new String[] { "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "뉴욕", "인천", "인천", "인천", "인천", "두바이", "두바이",
				"두바이", "두바이", "두바이", "볼레", "두바이", "뉴욕", "뉴욕", "뉴욕", "시드니", "파리", "파리", "파리", "인천", "인천", "인천", "시드니",
				"시드니", "시드니", "파리", "파리", "파리", "파리", "파리", "파리", "파리", "시드니", "시드니", "두바이", "두바이", "볼레", "인천", "뉴욕",
				"뉴욕", "뉴욕", "뉴욕", "두바이", "뉴욕", "인천", "인천", "두바이", "두바이", "두바이", "인천", "인천", "두바이", "두바이", "파리", "파리",
				"파리", "파리", "파리", "파리", "시드니", "시드니", "시드니", "시드니", "뉴욕", "뉴욕", "뉴욕", "파리", "인천", "인천", "인천", "두바이",
				"두바이", "두바이", "볼레" };

		s_gate = new String[] { "268", "266", "10", "126", "110", "40", "15", "117", "162", "78", "45", "23", "24",
				"14", "13", "27", "19", "21", "20", "87", "115", "80", "17", "36", "152", "117", "137", "75", "37",
				"08", "46", "4", "25", "17", "65", "13", "20", "34", "110", "127", "47", "12", "32", "67", "97", "121",
				"105", "3", "35", "45", "12", "31", "2", "87", "115", "25", "73", "14", "7", "61", "61", "62", "63",
				"61", "68", "15", "23", "25", "23", "74", "74", "74", "15", "64", "97", "64", "102", "104", "102", "120" };

		a_gate = new String[] { "52", "10", "98", "162", "200", "117", "31", "40", "25", "78", "23", "78", "45", "25",
				"14", "35", "45", "50", "87", "16", "34", "14", "28", "36", "118", "170", "32", "10", "97", "113", "45",
				"90", "87", "13", "15", "43", "27", "112", "50", "7", "73", "15", "36", "110", "113", "46", "34", "71",
				"56", "76", "23", "25", "180", "156", "197", "61", "132", "21", "5", "47", "59", "110", "112", "121",
				"107", "27", "64", "64", "64", "25", "25", "26", "104", "91", "25", "92", "112", "112", "114", "121" };

		s_time = new String[] { "10:27", "10:30", "10:46", "15:30", "17:30", "19:30", "20:00", "14:30", "08:10",
				"06:15", "06:30", "18:25", "18:35", "17:50", "16:00", "10:30", "04:25", "01:00", "08:30", "02:50",
				"09:45", "07:10", "03:30", "07:30", "09:10", "09:15", "03:40", "01:35", "06:00", "05:00", "09:45",
				"00:40", "08:20", "14:40", "06:20", "12:30", "09:05", "13:20", "00:30", "07:15", "00:00", "13:25",
				"01:15", "14:00", "18:15", "11:50", "08:00", "19:40", "01:55", "10:35", "10:15", "08:45", "06:55",
				"06:00", "05:45", "00:50", "13:00", "00:00", "02:10", "02:15", "10:40", "08:10", "03:45", "00:55",
				"01:25", "06:10", "18:00", "02:45", "07:15", "00:30", "07:00", "09:15", "00:15", "01:10", "00:00",
				"03:45", "10:00", "13:05", "05:40", "13:38" };

		a_time = new String[] { "15:00", "15:10", "15:05", "18:40", "20:10", "21:40", "23:12", "17:45", "11:40",
				"09:20", "16:30", "23:55", "23:45", "23:30", "21:10", "15:45", "07:40", "06:15", "14:25", "08:50",
				"19:00", "20:30", "16:25", "20:45", "22:15", "21:45", "16:55", "14:10", "13:20", "11:50", "17:25",
				"06:05", "13:30", "20:00", "12:00", "17:50", "14:10", "18:30", "11:00", "17:50", "05:35", "18:35",
				"09:30", "17:50", "20:30", "14:20", "10:15", "22:00", "11:15", "16:40", "19:00", "17:45", "15:15",
				"13:20", "12:55", "05:15", "17:30", "21:25", "23:45", "15:40", "23:50", "21:30", "16:55", "14:10",
				"15:40", "11:30", "22:10", "06:40", "11:40", "08:10", "16:15", "17:44", "06:05", "19:55", "18:40",
				"22:10", "19:40", "22:00", "14:50", "13:41" };

		checkin = new String[] { "C15", "A85", "C20", "B11", "C8", "D29", "C24", "D15", "C5", "C12", "A9", "A02", "A10",
				"C15", "B25", "B1", "B20", "C10", "D21", "A17", "C03", "C15", "A2", "D11", "A7", "B13", "C2", "C18",
				"B15", "C28", "A10", "B15", "A16", "A16", "D10", "C10", "B19", "D7", "C10", "D10", "D14", "D14", "B10",
				"C5", "A2", "A2", "A13", "A13", "D11", "C8", "A7", "A7", "B5", "B5", "B5", "C15", "C17", "A20", "A20",
				"D1", "C5", "C5", "C5", "C5", "C5", "A5", "A7", "A7", "A7", "D12", "D12", "D12", "A1", "C7", "A5", "C7",
				"D15", "D15", "D15", "D15" };

		baggage = new String[] { "3", "3", "3", "2", "1", "2", "2", "6", "6", "5", "4", "1", "2", "3", "2", "2", "1",
				"1", "3", "2", "1", "5", "3", "3", "3", "1", "2", "2", "1", "1", "1", "2", "3", "3", "1", "2", "2", "4",
				"1", "5", "1", "2", "3", "2", "3", "1", "2", "2", "1", "1", "2", "4", "3", "3", "3", "1", "1", "2", "2",
				"3", "1", "1", "1", "1", "1", "1", "1", "1", "1", "4", "4", "4", "1", "3", "1", "3", "5", "5", "5", "5" };

		s_terminal = new String[] { "T1", "T2", "T2", "T2", "T1", "T1", "T1", "T5", "T5", "T4", "T1", "T2", "T1", "T1",
				"T2", "T2", "T1", "T1", "T1", "T2", "T1", "T1", "T2", "T3", "T2", "T1", "T2", "T2", "T3", "T3", "T3",
				"T1", "T2", "T2", "T2", "T1", "T1", "T1", "T1", "T2", "T1", "T1", "T3", "T3", "T2", "T2", "T2", "T2",
				"T1", "T1", "T2", "T2", "T1", "T1", "T1", "T2", "T2", "T3", "T3", "T1", "T1", "T1", "T1", "T1", "T1",
				"T2", "T2", "T2", "T2", "T4", "T4", "T4", "T1", "T2", "T2", "T2", "T3", "T3", "T3", "T3" };

		a_terminal = new String[] { "T2", "T2", "T3", "T4", "T2", "T3", "T2", "T3", "T1", "T2", "T3", "T2", "T3", "T1",
				"T3", "T3", "T1", "T3", "T4", "T1", "T3", "T1", "T1", "T3", "T2", "T2", "T4", "T3", "T2", "T1", "T2",
				"T3", "T2", "T3", "T3", "T2", "T3", "T3", "T2", "T1", "T4", "T2", "T1", "T1", "T3", "T1", "T1", "T3",
				"T1", "T3", "T1", "T3", "T3", "T1", "T2", "T1", "T1", "T1", "T1", "T2", "T2", "T2", "T2", "T2", "T2",
				"T4", "T4", "T4", "T3", "T2", "T2", "T2", "T4", "T1", "T1", "T1", "T3", "T3", "T3", "T3" };

		// 각 배열 끝 인덱스값 알아보기
//		System.out.println("flight_Code:" + flight_Code.length + "\n airLine : " + airLine.length + "\n s_airport : "
//				+ s_airport.length + "\n a_airport : " + a_airport.length + "\n s_gate : " + s_gate.length
//				+ "\n a_gate : " + a_gate.length + "\n s_time: " + s_time.length + "\n a_time : " + a_time.length
//				+ "\n checkin : " + checkin.length + "\n baggage : " + baggage.length + "\n a_terminal : "
//				+ a_terminal.length + "\n s_terminal : " + s_terminal.length + "\n s_airportCode : "
//				+ s_airportCode.length + "\n a_airportCode : " + a_airportCode.length);

		// 줄줄 출력문
//		for (int i = 0; i < airLine.length; i++) {
//			System.out.println("항공편명 : " + flight_Code[i] + " 항공사 : " + airLine[i] + " 출발 : " + s_airport[i] + " 도착 : "
//					+ a_airport[i] + " 출발 게이트 : " + s_gate[i] + " 도착 게이트 : " + a_gate[i] + " 출발시각 :" + s_time[i]
//					+ " 도착시각 : " + a_time[i] + " 체크인 카운터 : " + checkin[i] + " 수하물 : " + baggage[i] + " 터미널 : "
//					+ terminal[i]);
//		}
//System.out.println("================================");

		// 포맷
//		for (int i = 0; i < airLine.length; i++) {
//			System.out.printf(
//					"%d %5s \t%8s  \t%3s/%3s \t%3s/%3s \t %s\t%5s \t %5s \t %5s \t %5s \t %5s \t %5s \t %5s\n", i,
//					flight_Code[i], airLine[i], s_airport[i], s_airportCode[i], a_airport[i], a_airportCode[i],
//					s_gate[i], a_gate[i], s_time[i], a_time[i], checkin[i], baggage[i], a_terminal[i], s_terminal[i]);
//		}

		// 항공편ID 중복이 있는지 알아보는포문
//		for (int i = 0; i < airLine.length; i++) {
//			for (int j = i + 1; j < airLine.length; j++) {
//				if (flight_Code[i].equals(flight_Code[j])) {
//					System.out.println("i:" + i + " " + flight_Code[i] + " / j:" + j + " " + flight_Code[j]);
//				}
//			}
//		}
	}

	@Override
	public void run() {
		while (true) {

			state = new String[flight_Code.length];
			for (int i = 0; i < flight_Code.length; i++) {

				String[] s_tmp = s_time[i].split(":");
				String[] a_tmp = a_time[i].split(":");
				int tmp00, tmp01, s_total, a_total, n_total;
				tmp00 = Integer.parseInt(s_tmp[0]);
				tmp01 = Integer.parseInt(s_tmp[1]);
				s_total = (tmp00 * 60 + tmp01) * 60;
				tmp00 = Integer.parseInt(a_tmp[0]);
				tmp01 = Integer.parseInt(a_tmp[1]);
				a_total = (tmp00 * 60 + tmp01) * 60;

				long systemTime = System.currentTimeMillis();
				SimpleDateFormat dayTime = new SimpleDateFormat("HH:mm:ss");
				String n_time = dayTime.format(new Date(systemTime));

				String[] n_tmp = n_time.split(":");
				tmp00 = Integer.parseInt(n_tmp[0]);
				tmp01 = Integer.parseInt(n_tmp[1]);
				n_total = (tmp00 * 60 + tmp01) * 60 + Integer.parseInt(n_tmp[2]);

				if (n_total <= s_total || n_total >= a_total) {
					state[i] = "대기";
				} else {
					state[i] = "출발";

				}
			}
			System.out.println("길이 체크 : " + state.length);
			try {
				Thread.sleep(32222);
			} catch (InterruptedException e) {
				e.printStackTrace();
			}
		}
	}

	public static void main(String[] args) {
		DataDummy dm = new DataDummy();

	}
}